# Pandas

In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [2]:
l= [4.5,5,3,4.1,3.2]
l

[4.5, 5, 3, 4.1, 3.2]

In [3]:
series = Series(l,index=['A','B','C','D','E'])
series

A    4.5
B    5.0
C    3.0
D    4.1
E    3.2
dtype: float64

In [4]:
array = np.array([4.5,5,3,4.1,3.2])
sarray = Series(array)
sarray

0    4.5
1    5.0
2    3.0
3    4.1
4    3.2
dtype: float64

In [5]:
dic = {'A':6,'B':8,'C':7,'D':9,'E':5}
sdic = Series(dic)
sdic

A    6
B    8
C    7
D    9
E    5
dtype: int64

In [6]:
sdic['A']

6

In [7]:
sdic[['B','D']]

B    8
D    9
dtype: int64

In [8]:
sdic>6

A    False
B     True
C     True
D     True
E    False
dtype: bool

In [9]:
sdic[sdic>6]

B    8
C    7
D    9
dtype: int64

In [10]:
sdic.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [11]:
sdic.values

array([6, 8, 7, 9, 5], dtype=int64)

# Replacing

In [12]:
series = Series(np.arange(1,8))
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [13]:
series.replace(0,'$',inplace=True)
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [14]:
series.replace([2,3],[0,8])

0    1
1    0
2    8
3    4
4    5
5    6
6    7
dtype: int32

In [15]:
series.replace({8:2})

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [16]:
series.replace(5,method='bfill')

0    1
1    2
2    3
3    4
4    6
5    6
6    7
dtype: int32

In [17]:
series.replace(5,method='ffill')

0    1
1    2
2    3
3    4
4    4
5    6
6    7
dtype: int32

# Dataframe

In [18]:
df = pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [19]:
df.replace([1,5,9],[1,2,3])

   A  B  C
0  1  4  7
1  2  2  8
2  3  6  3

In [20]:
df.replace({'B':6,'C':8,},3)

   A  B  C
0  1  4  7
1  2  5  3
2  3  3  9

In [21]:
df.replace({'C':{8:3,9:3}})

   A  B  C
0  1  4  7
1  2  5  3
2  3  6  3

In [22]:
df.replace([4,7,5,6,8,9],[2,3,2,3,3,3])

   A  B  C
0  1  2  3
1  2  2  3
2  3  3  3

# Column and Row Elimination

In [23]:
cr = Series(np.arange(1,6),index=['R1','R2','R3','R4','R5'])
cr

R1    1
R2    2
R3    3
R4    4
R5    5
dtype: int32

In [24]:
cr.drop('R1')

R2    2
R3    3
R4    4
R5    5
dtype: int32

In [25]:
cr

R1    1
R2    2
R3    3
R4    4
R5    5
dtype: int32

In [26]:
cr.drop('R1',inplace=True)
cr

R2    2
R3    3
R4    4
R5    5
dtype: int32

In [27]:
cr

R2    2
R3    3
R4    4
R5    5
dtype: int32

In [28]:
cr.drop(['R2','R3'],inplace=True)
cr

R4    4
R5    5
dtype: int32

In [29]:
crdf = DataFrame(np.arange(1,26).reshape(5,5),
                   index=['R1','R2','R3','R4','R5'],
                   columns=['C1','C2','C3','C4','C5'])
crdf

    C1  C2  C3  C4  C5
R1   1   2   3   4   5
R2   6   7   8   9  10
R3  11  12  13  14  15
R4  16  17  18  19  20
R5  21  22  23  24  25

In [30]:
crdf.drop('C1',axis=1)

    C2  C3  C4  C5
R1   2   3   4   5
R2   7   8   9  10
R3  12  13  14  15
R4  17  18  19  20
R5  22  23  24  25

In [31]:
crdf.drop(columns='C2')

    C1  C3  C4  C5
R1   1   3   4   5
R2   6   8   9  10
R3  11  13  14  15
R4  16  18  19  20
R5  21  23  24  25

In [32]:
crdf.drop('R1',axis=0)

    C1  C2  C3  C4  C5
R2   6   7   8   9  10
R3  11  12  13  14  15
R4  16  17  18  19  20
R5  21  22  23  24  25

In [33]:
crdf.drop(index='R1')

    C1  C2  C3  C4  C5
R2   6   7   8   9  10
R3  11  12  13  14  15
R4  16  17  18  19  20
R5  21  22  23  24  25

In [34]:
crdf.drop(index='R1',columns='C1')

    C2  C3  C4  C5
R2   7   8   9  10
R3  12  13  14  15
R4  17  18  19  20
R5  22  23  24  25

In [35]:
crdf.drop(index=['R1','R2'],columns=['C1','C2'])

    C3  C4  C5
R3  13  14  15
R4  18  19  20
R5  23  24  25

In [36]:
crdf.drop(['R3','R4'])

    C1  C2  C3  C4  C5
R1   1   2   3   4   5
R2   6   7   8   9  10
R5  21  22  23  24  25

# Concatenating
Another way to join DataFrames is the concat() function. This function concatenates two DataFrames together.

In [37]:
con1 = Series(np.arange(1,6),index=['R1','R2','R3','R4','R5'])
con1

R1    1
R2    2
R3    3
R4    4
R5    5
dtype: int32

In [38]:
con2 = Series(np.arange(6,11),index=['R6','R7','R8','R9','R10'])
con2

R6      6
R7      7
R8      8
R9      9
R10    10
dtype: int32

In [39]:
pd.concat([con1,con2])

R1      1
R2      2
R3      3
R4      4
R5      5
R6      6
R7      7
R8      8
R9      9
R10    10
dtype: int32

In [40]:
pd.concat([con1,con2],axis=1)

       0     1
R1   1.0   NaN
R2   2.0   NaN
R3   3.0   NaN
R4   4.0   NaN
R5   5.0   NaN
R6   NaN   6.0
R7   NaN   7.0
R8   NaN   8.0
R9   NaN   9.0
R10  NaN  10.0

In [41]:
con3 = Series(np.arange(11,16),index=['R11','R12','R13','R14','R15'])
con3

R11    11
R12    12
R13    13
R14    14
R15    15
dtype: int32

In [42]:
pd.concat([con1,con2,con3],axis=1)

       0     1     2
R1   1.0   NaN   NaN
R2   2.0   NaN   NaN
R3   3.0   NaN   NaN
R4   4.0   NaN   NaN
R5   5.0   NaN   NaN
R6   NaN   6.0   NaN
R7   NaN   7.0   NaN
R8   NaN   8.0   NaN
R9   NaN   9.0   NaN
R10  NaN  10.0   NaN
R11  NaN   NaN  11.0
R12  NaN   NaN  12.0
R13  NaN   NaN  13.0
R14  NaN   NaN  14.0
R15  NaN   NaN  15.0

In [43]:
pd.concat([con1,con2,con3],axis=1,keys=['con1','con2','con3'])

     con1  con2  con3
R1    1.0   NaN   NaN
R2    2.0   NaN   NaN
R3    3.0   NaN   NaN
R4    4.0   NaN   NaN
R5    5.0   NaN   NaN
R6    NaN   6.0   NaN
R7    NaN   7.0   NaN
R8    NaN   8.0   NaN
R9    NaN   9.0   NaN
R10   NaN  10.0   NaN
R11   NaN   NaN  11.0
R12   NaN   NaN  12.0
R13   NaN   NaN  13.0
R14   NaN   NaN  14.0
R15   NaN   NaN  15.0

In [44]:
pd.concat([con1,con2,con3],ignore_index=True)

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
dtype: int32

In [45]:
import numpy as np
arrs=np.array([[1,6],[4,3]])
print(arrs)
x=arrs.max(axis=0)
x

[[1 6]
 [4 3]]

array([4, 6])

In [46]:
cdf1 = DataFrame(np.random.rand(4,3),
               columns=['X','Y','Z'])

cdf1

          X         Y         Z
0  0.665474  0.281489  0.506602
1  0.178254  0.733182  0.565631
2  0.787746  0.714946  0.815495
3  0.577368  0.796564  0.666010

In [47]:
cdf2 = DataFrame(np.random.rand(4,3),
               columns=['W','Y','Z'])

cdf2

          W         Y         Z
0  0.758870  0.316229  0.831744
1  0.497952  0.758865  0.742798
2  0.657248  0.360509  0.418978
3  0.644453  0.189586  0.948158

In [48]:
pd.concat([cdf1,cdf2],sort=True)

          W         X         Y         Z
0       NaN  0.665474  0.281489  0.506602
1       NaN  0.178254  0.733182  0.565631
2       NaN  0.787746  0.714946  0.815495
3       NaN  0.577368  0.796564  0.666010
0  0.758870       NaN  0.316229  0.831744
1  0.497952       NaN  0.758865  0.742798
2  0.657248       NaN  0.360509  0.418978
3  0.644453       NaN  0.189586  0.948158

In [49]:
pd.concat([cdf1,cdf2],sort=False)

          X         Y         Z         W
0  0.665474  0.281489  0.506602       NaN
1  0.178254  0.733182  0.565631       NaN
2  0.787746  0.714946  0.815495       NaN
3  0.577368  0.796564  0.666010       NaN
0       NaN  0.316229  0.831744  0.758870
1       NaN  0.758865  0.742798  0.497952
2       NaN  0.360509  0.418978  0.657248
3       NaN  0.189586  0.948158  0.644453

In [50]:
pd.concat([cdf1,cdf2],sort=False,ignore_index=True)   
#default -> join = outer

          X         Y         Z         W
0  0.665474  0.281489  0.506602       NaN
1  0.178254  0.733182  0.565631       NaN
2  0.787746  0.714946  0.815495       NaN
3  0.577368  0.796564  0.666010       NaN
4       NaN  0.316229  0.831744  0.758870
5       NaN  0.758865  0.742798  0.497952
6       NaN  0.360509  0.418978  0.657248
7       NaN  0.189586  0.948158  0.644453

In [51]:
pd.concat([cdf1,cdf2],sort=True,ignore_index=True,join='inner')

          Y         Z
0  0.281489  0.506602
1  0.733182  0.565631
2  0.714946  0.815495
3  0.796564  0.666010
4  0.316229  0.831744
5  0.758865  0.742798
6  0.360509  0.418978
7  0.189586  0.948158

In [52]:
cdf3 = DataFrame(np.random.randint(10,30,(1,3)),
               columns=['X','Y','Z'])

cdf3

    X   Y   Z
0  19  19  11

In [53]:
cdf4 = pd.DataFrame({'Names': ['Akilan', 'Karthik', 'Jeswin'],
                     'Age': ['21', '22', '22']},
                      index=['1', '2', '3']) 
cdf4

     Names Age
1   Akilan  21
2  Karthik  22
3   Jeswin  22

In [54]:
cdf5 = pd.DataFrame({'Native': ['India', 'India', 'India'],'Location': ['Chennai', 'Chennai', 'Tiruneveli']},
                    index=['1', '3', '4'])
cdf5

  Native    Location
1  India     Chennai
3  India     Chennai
4  India  Tiruneveli

In [55]:
cdf4.join(cdf5)

     Names Age Native Location
1   Akilan  21  India  Chennai
2  Karthik  22    NaN      NaN
3   Jeswin  22  India  Chennai

In [56]:
cdf4.join(cdf5,how='inner')

    Names Age Native Location
1  Akilan  21  India  Chennai
3  Jeswin  22  India  Chennai

# Statistics
Pandas provides built-in functions to statistically investigate the data. Let's check out some important ones!

import numpy as np

In [57]:
l1 = [[90,89,80,95],[87,86,80,90],[87,77,np.nan,78],[np.nan,67,69,89]]
l1

[[90, 89, 80, 95], [87, 86, 80, 90], [87, 77, nan, 78], [nan, 67, 69, 89]]

In [58]:
ldf=DataFrame(l1,index=['Akilan','Karthik','David','Jeswin'],columns=['English','Tamil','Maths','Science'])
ldf

         English  Tamil  Maths  Science
Akilan      90.0     89   80.0       95
Karthik     87.0     86   80.0       90
David       87.0     77    NaN       78
Jeswin       NaN     67   69.0       89

In [59]:
ldf.sum(axis=1)

Akilan     354.0
Karthik    343.0
David      242.0
Jeswin     225.0
dtype: float64

In [60]:
ldf.describe()

         English      Tamil      Maths    Science
count   3.000000   4.000000   3.000000   4.000000
mean   88.000000  79.750000  76.333333  88.000000
std     1.732051   9.912114   6.350853   7.164728
min    87.000000  67.000000  69.000000  78.000000
25%    87.000000  74.500000  74.500000  86.250000
50%    87.000000  81.500000  80.000000  89.500000
75%    88.500000  86.750000  80.000000  91.250000
max    90.000000  89.000000  80.000000  95.000000

In [61]:
ldf.max()

English    90.0
Tamil      89.0
Maths      80.0
Science    95.0
dtype: float64

In [62]:
ldf.max(axis=1)

Akilan     95.0
Karthik    90.0
David      87.0
Jeswin     89.0
dtype: float64

In [63]:
ldf.idxmax()

English    Akilan
Tamil      Akilan
Maths      Akilan
Science    Akilan
dtype: object

# Missing Values

In [64]:
ms = Series([np.nan,5,7,4,3,np.nan],index=['NFS','HFF','PUBG','SUS','FFR','GGT'])
ms

NFS     NaN
HFF     5.0
PUBG    7.0
SUS     4.0
FFR     3.0
GGT     NaN
dtype: float64

In [65]:
ms.isnull()

NFS      True
HFF     False
PUBG    False
SUS     False
FFR     False
GGT      True
dtype: bool

In [66]:
ms.dropna()

HFF     5.0
PUBG    7.0
SUS     4.0
FFR     3.0
dtype: float64

In [67]:
nil = np.nan
mdf = DataFrame([[8.4,5.7,6.8,nil],[7.6,8.7,8.0,6.6],[8.7,nil,7,6.9],[7.1,6.3,9,5]])
mdf

     0    1    2    3
0  8.4  5.7  6.8  NaN
1  7.6  8.7  8.0  6.6
2  8.7  NaN  7.0  6.9
3  7.1  6.3  9.0  5.0

In [68]:
mdf.dropna()

     0    1    2    3
1  7.6  8.7  8.0  6.6
3  7.1  6.3  9.0  5.0

In [69]:
mdf.dropna(axis=1)

     0    2
0  8.4  6.8
1  7.6  8.0
2  8.7  7.0
3  7.1  9.0

In [70]:
mdf.dropna(how='all')   # #the row is eliminated only if all its values are missing

     0    1    2    3
0  8.4  5.7  6.8  NaN
1  7.6  8.7  8.0  6.6
2  8.7  NaN  7.0  6.9
3  7.1  6.3  9.0  5.0

In [71]:
mdf.dropna(thresh=4)    # # keep the row if it has mininum 4 non-NaN values

     0    1    2    3
1  7.6  8.7  8.0  6.6
3  7.1  6.3  9.0  5.0

In [72]:
mdf

     0    1    2    3
0  8.4  5.7  6.8  NaN
1  7.6  8.7  8.0  6.6
2  8.7  NaN  7.0  6.9
3  7.1  6.3  9.0  5.0

In [73]:
mdf.dropna(thresh=4,axis=1)

     0    2
0  8.4  6.8
1  7.6  8.0
2  8.7  7.0
3  7.1  9.0

In [74]:
len(mdf)

4

In [75]:
mdf.fillna(value=9)

     0    1    2    3
0  8.4  5.7  6.8  9.0
1  7.6  8.7  8.0  6.6
2  8.7  9.0  7.0  6.9
3  7.1  6.3  9.0  5.0

In [76]:
mdf.count()

0    4
1    3
2    4
3    3
dtype: int64

In [77]:
mdf.fillna(value=mdf.mean())

     0    1    2         3
0  8.4  5.7  6.8  6.166667
1  7.6  8.7  8.0  6.600000
2  8.7  6.9  7.0  6.900000
3  7.1  6.3  9.0  5.000000

In [78]:
mdf.fillna(value=mdf[3].mean())

     0         1    2         3
0  8.4  5.700000  6.8  6.166667
1  7.6  8.700000  8.0  6.600000
2  8.7  6.166667  7.0  6.900000
3  7.1  6.300000  9.0  5.000000

In [79]:
mdf

     0    1    2    3
0  8.4  5.7  6.8  NaN
1  7.6  8.7  8.0  6.6
2  8.7  NaN  7.0  6.9
3  7.1  6.3  9.0  5.0

In [80]:
mdf.fillna(value=mdf[3].mean())

     0         1    2         3
0  8.4  5.700000  6.8  6.166667
1  7.6  8.700000  8.0  6.600000
2  8.7  6.166667  7.0  6.900000
3  7.1  6.300000  9.0  5.000000

In [81]:
nil = np.nan
mdf1 = DataFrame([[0,4,8,9],[nil,6,8,nil],[8,nil,7,6],[7,6,9,5]])
mdf1

     0    1  2    3
0  0.0  4.0  8  9.0
1  NaN  6.0  8  NaN
2  8.0  NaN  7  6.0
3  7.0  6.0  9  5.0

In [82]:
mdf1[0].fillna(value=mdf1[0].mean())

0    0.0
1    5.0
2    8.0
3    7.0
Name: 0, dtype: float64

In [83]:
idf = DataFrame(data=np.arange(1,26).reshape(5,5),
              index=['x','y','z','m','n'],
              columns=['A','B','C','D','E'])
idf

    A   B   C   D   E
x   1   2   3   4   5
y   6   7   8   9  10
z  11  12  13  14  15
m  16  17  18  19  20
n  21  22  23  24  25

In [84]:
idf['A']

x     1
y     6
z    11
m    16
n    21
Name: A, dtype: int32

In [85]:
idf[['A','B']]

    A   B
x   1   2
y   6   7
z  11  12
m  16  17
n  21  22

In [86]:
idf.loc['x']

A    1
B    2
C    3
D    4
E    5
Name: x, dtype: int32

In [87]:
idf.loc[['x','y']]

   A  B  C  D   E
x  1  2  3  4   5
y  6  7  8  9  10

In [88]:
idf.iloc[0]     #using index position iloc

A    1
B    2
C    3
D    4
E    5
Name: x, dtype: int32

In [89]:
idf.iloc[[0,1]]

   A  B  C  D   E
x  1  2  3  4   5
y  6  7  8  9  10

In [90]:
idf.iloc[[0,1,2],[0,1,2]]

    A   B   C
x   1   2   3
y   6   7   8
z  11  12  13

In [91]:
idf

    A   B   C   D   E
x   1   2   3   4   5
y   6   7   8   9  10
z  11  12  13  14  15
m  16  17  18  19  20
n  21  22  23  24  25

In [92]:
idf>13

       A      B      C      D      E
x  False  False  False  False  False
y  False  False  False  False  False
z  False  False  False   True   True
m   True   True   True   True   True
n   True   True   True   True   True

In [93]:
idf[idf>13]

      A     B     C     D     E
x   NaN   NaN   NaN   NaN   NaN
y   NaN   NaN   NaN   NaN   NaN
z   NaN   NaN   NaN  14.0  15.0
m  16.0  17.0  18.0  19.0  20.0
n  21.0  22.0  23.0  24.0  25.0

In [94]:
idf[idf['C']>13]

    A   B   C   D   E
m  16  17  18  19  20
n  21  22  23  24  25

In [95]:
Ser=Series([3,5,6,9],index=['a','b','c','d'])
Ser

a    3
b    5
c    6
d    9
dtype: int64

In [96]:
Ser

a    3
b    5
c    6
d    9
dtype: int64

In [97]:
Ser>4

a    False
b     True
c     True
d     True
dtype: bool

In [98]:
Ser[Ser>4]

b    5
c    6
d    9
dtype: int64

In [100]:
import json 
    
# python object(dictionary) to be dumped 
dict1 ={ 
    "emp1": { 
        "name": "Kani", 
        "designation": "Director", 
        "age": "37", 
        "salary": "100000"
    }, 
    "emp2": { 
        "name": "Venkat", 
        "designation": "Data Analyst", 
        "age": "24", 
        "salary": "80000"
    }, 
} 
    
# the json file where the output must be stored 
out_file = open("myfile.json", "w") 
    
json.dump(dict1, out_file, indent = 6) 
    
out_file.close()